---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MechanicalSystem.IsWellConnected
source: html/f7e4da51-9d15-0c60-c4f7-862efe580643.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalSystem.IsWellConnected Property

Indicates if the system is well connected or not.

## Syntax (C#)
```csharp
public bool IsWellConnected { get; }
```

## Remarks
If the system is not well connected, parameters which need to be calculated are invalid.